{"meta":{"title":"ZeoRexDevs","subtitle":"Home of Development","description":"This site is made by fr3aky_phantom mainly for WALTON Primo RX5 as-well-as GIONEE F103 Pro","author":"fr3aky_phantom","url":"https://ZeoRexDevs.github.io","root":"/"},"pages":[],"posts":[{"title":"Hello World","slug":"hello-world","date":"2021-04-05T06:14:39.561Z","updated":"2021-04-05T06:14:39.561Z","comments":true,"path":"2021/04/hello-world/","link":"","permalink":"https://zeorexdevs.github.io/2021/04/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]},{"title":"TeamWin Recovery Project 3.2.1-0","slug":"twrp-3.2.1-0","date":"2017-12-10T18:00:00.000Z","updated":"2021-04-05T06:14:39.561Z","comments":true,"path":"2017/12/twrp-3.2.1-0/","link":"","permalink":"https://zeorexdevs.github.io/2017/12/twrp-3.2.1-0/","excerpt":"TWRP downloads","text":"TWRP is an open source, community project. A custom recovery is used for installing custom software on your device. This custom software can include smaller modifications like rooting your device or even replacing the firmware of the device with a completely custom “ROM” like LineageOS or OmniROM. Important notice I am not responsible for bricked devices, dead SD cards, thermonuclear war, or you getting fired because the alarm app failed. Please do some research if you have any concerns about features included in this recovery before flashing it! YOU are choosing to make these modifications, and if you point the finger at me for messing up your device, I will laugh at you. If you have some doubts, you can ask me here Changelog For v3.2.1-0 minui fixes (cryptomilk) Better android-8.0 compatibility in ROM trees (Dees_Troy) Fix missing library in android-8.0 (nkk71) Fix inconsistent SDCard naming (DevUt) Default to TWRP restore instead of adb backup restore to fix restore on fresh TWRP boot (jlask) Downloads &amp; Device trees Device Download links Device tree Build Status Build log Huawei Honor 3C Lite Download View Working Download Acer Liquid Z500 Download View Working Download Acer Liquid Z520 Download View Working Download Lenovo A536 Download View Working Download QMobile X70 Download View Working Download Micromax Canvas Selfie Lens Q345 Download View Working Download Lava Iris X8 Download View Working Download Lenovo A328 Download View Working Download XOLO Omega 5.5 Download View Working Download Oppo Neo 7 Download View Working Download Symphony Xplorer V80 Download View Working Download HTC Desire 620G Download View Working Download Cherry Mobile Me Vibe Download View Working Download Intex Aqua Power HD Download View Working Download Prestigio MultiPhone 5504 Duo Download View Working Download Xiaomi Redmi Note 3G Download View Working Download Lenovo S860 Download View Working Download Kingzone K1 Turbo Download View Working Download LG G3 Stylus Download View Working Download HTC Desire 816G Download View Working Download Xiaomi Redmi 1S TD Download View Working Download Gionee M2 Download View Working Download Micromax Canvas Hue Download View Working Download Doogee X5 Download View Working Download Infinix Zero 2 X509 Download View Working Download Credits TeamWin Akshay Sankle Ethan Yonker aka Dees_Troy OmniROM Liquid Porting &amp; Development Vojtěch Hejsek","categories":[{"name":"blog","slug":"blog","permalink":"https://zeorexdevs.github.io/categories/blog/"}],"tags":[],"author":"Vojtěch Hejsek"},{"title":"New website, MediaTek & Snapdragon support, new ROMs, maintainers","slug":"news","date":"2017-08-06T18:00:00.000Z","updated":"2021-04-05T06:14:39.561Z","comments":true,"path":"2017/08/news/","link":"","permalink":"https://zeorexdevs.github.io/2017/08/news/","excerpt":"Just to make it clear","text":"To begin, I’ve got some news related to some future plans of Liquid Porting &amp; Development Team and some notices that I won’t repeat again and again. This WebsiteFirst of, I have to tell you something about this website and it’s purpose.This website was recently created to share all our work, since we don’t want to use our Facebook page as our main page, so that’s why you are reading these words right here and right now.It’s tailored specifically for sharing the latest ROM &amp; Recovery builds for our supported devices.Our team is aimed to provide the latest OS with high reliability and stability for as many devices as possible, BUT there’s something we have to let you know about. Device requests and maintainingIf you are familiar with Android development for various devices at least a bit, you probably know, that there’s a lot of fails, testing, compiling, coding in some cases behind bootable &amp; fully stable ROM build and every device we build a custom softwarefor needs it’s maintainer (at least one) so it’s simply IMPOSSIBLE for us to build for every device you request because we don’t have anyone, who owns that device and can maintain it, so what’s why we are lettingyou know about this little problem. If you are interested in maintaining a new device, contact us via E-mail or Facebook.You must: Have a GitHub profile Knowledge about flashing, restoring bricked device, troubleshooting Have working source code for a particular device Be able to compile ROMs and recoveries Snapdragon &amp; MediaTek (legacy devices in general)Well, Liquid Porting &amp; Development started with MediaTek devices based on MT6582, then continued with MT6592. We provided MANY custom ROMs with a bunch of features with different base such as AOSP and LineageOS (successor of CyanogenMod) for devicesrunning on these chipsets starting with KitKat based through Lollipop to Marshmallow. But even MediaTek development has it’s limits and we decided to end support for our MediaTek devices due to lack of community support, and we couldn’t handle it alone.All MediaTek will recieve only TWRP updates since developers lost their interest in ROM development for MediaTek MT6582/92 so don’t expect Nougat (7.1.2) or newer. And now some words about Snapdragon devices. Since we ended our support for MediaTek devices (the old ones) we are going to start again and support Snapdragon devices with the latest Android OS version and TWRP recovery.A list of devices with planned support includes following: Xiaomi Redmi 4A (rolex) Xiaomi Redmi 4X (santoni) Xiaomi Redmi 4 (prada) OnePlus 5 (cheeseburger) If you want you device to be in this list and you got some skills in Android development, do not hesitate and let us know :)","categories":[{"name":"blog","slug":"blog","permalink":"https://zeorexdevs.github.io/categories/blog/"}],"tags":[],"author":"Vojtěch Hejsek"},{"title":"Stock Flashable Amigo OS ROM","slug":"Stock Flashable Amigo OS ROM","date":"2017-07-27T18:00:00.000Z","updated":"2021-04-05T06:14:39.561Z","comments":true,"path":"2017/07/Stock Flashable Amigo OS ROM/","link":"","permalink":"https://zeorexdevs.github.io/2017/07/Stock%20Flashable%20Amigo%20OS%20ROM/","excerpt":"","text":"When Phone Manufacturers Releases their phones, the Default Operating System placed inside them is called Stock Rom or FirmwareStock ROM is always Almost Bugless and Smooth, but often it can Lag and Hang on High Use. The Stock ROM of Walton Primo RX5 (And it’s other ReBranded Models) is Gionee’s Amigo OS.It is namely Amigo OS v3.2, based on Android 6.0 Marshmallow. Here, The Stock ROM is Converted into TWRP Flashable ROM.This is easily flashable from within phone as when we use Custom ROMs, there are a few bugs there, and often we need to go back to the Original ROM. That’s why this file is convenient and time saving. This ROM is made from Factory Version (v5602). But this ROM does not include any OTA Fixes.And it is Rooted using SuperSU.But you could get OTA Support if you Unroot your phone after you install this ROM. And after Unrooting, you might have to Flash your Stock Recovery and Remove the TWRP to get new updates. Pre-Requirements Phone Rooted from PC TWRP v3.0 Preferred How To Flash? At First, Download this ROM (.zip) file and place inside External Memory Card or Internal Memory. Reboot into TWRP Recovery Mode. Backup “System”, “Data”, “NvRAM” and “NvData” partitions into External Memory Card using TWRP. Wipe “System”, “Data” and “Cache” partions only. Install this Zip file from below. After installation finishes, Reboot into New System. Note: First Boot may take about 15-25 minutes. Walton Primo RX5 Stock Rom Download LinkStock Rom Download @ GDrive ID=”0B00WsJWhmDk5Z3dwOVJ0TGlCV0E” [1.8 GB] Some Screenshots ![Text-1](/images/stock-1.jpg \"Caption-1\") ![Text-2](/images/stock-2.jpg \"Caption-2\")","categories":[{"name":"ROMs","slug":"ROMs","permalink":"https://zeorexdevs.github.io/categories/ROMs/"},{"name":"Stock ROM","slug":"ROMs/Stock-ROM","permalink":"https://zeorexdevs.github.io/categories/ROMs/Stock-ROM/"},{"name":"Custom ROMs v6","slug":"ROMs/Custom-ROMs-v6","permalink":"https://zeorexdevs.github.io/categories/ROMs/Custom-ROMs-v6/"}],"tags":[{"name":"Amigo OS","slug":"Amigo-OS","permalink":"https://zeorexdevs.github.io/tags/Amigo-OS/"},{"name":"Marshmallow","slug":"Marshmallow","permalink":"https://zeorexdevs.github.io/tags/Marshmallow/"}]}],"categories":[{"name":"blog","slug":"blog","permalink":"https://zeorexdevs.github.io/categories/blog/"},{"name":"ROMs","slug":"ROMs","permalink":"https://zeorexdevs.github.io/categories/ROMs/"},{"name":"Stock ROM","slug":"ROMs/Stock-ROM","permalink":"https://zeorexdevs.github.io/categories/ROMs/Stock-ROM/"},{"name":"Custom ROMs v6","slug":"ROMs/Custom-ROMs-v6","permalink":"https://zeorexdevs.github.io/categories/ROMs/Custom-ROMs-v6/"}],"tags":[{"name":"Amigo OS","slug":"Amigo-OS","permalink":"https://zeorexdevs.github.io/tags/Amigo-OS/"},{"name":"Marshmallow","slug":"Marshmallow","permalink":"https://zeorexdevs.github.io/tags/Marshmallow/"}]}